TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СопоставлениеФНПЛабАнализа/гкс_СопоставлениеФНПЛабАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СопоставлениеФНПЛабАнализа</name>
  <resources>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>DocumentRef.гкс_ЛабораторныйАнализ</types>
    </type>
  </resources>
  <resources>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </resources>
  <resources>
    <name>НазначениеИспользования</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </resources>
  <resources>
    <name>УсиленныйКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФормированиеНомераПробы</name>
    <type>
      <types>DocumentRef.гкс_ФормированиеНомераПробы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ЛабораторныйАнализ/гкс_ЛабораторныйАнализ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ЛабораторныйАнализ</name>
  <registerRecords>AccumulationRegister.гкс_ЗаданияНаКомпозитныеПробы</registerRecords>
  <registerRecords>InformationRegister.гкс_ФактическиеПоказателиКачества</registerRecords>
  <registerRecords>InformationRegister.гкс_ВнешниеПробыРегистрации</registerRecords>
  <attributes>
    <name>ВидЛабораторногоАнализа</name>
    <type>
      <types>CatalogRef.гкс_ВидыЛабораторногоАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбразцов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.гкс_СтатусыЛабораторногоАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      <types>DocumentRef.гкс_ФормированиеНомераПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НазначениеИспользованияКачества</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидПеревозки</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаПолученияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаНачалаАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаОкончанияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СостояниеТранспортногоСредства</name>
    <type>
      <types>EnumRef.гкс_СоответствиеТребованиям</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативнаяСертификация</name>
    <type>
      <types>DocumentRef.гкс_НормативнаяСертификацияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КачественныеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СоответствуетНормативу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонениеОтБазиса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Примечание</name>
      <comment>ERP-1475</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСоотвествия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсиленныйКонтроль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонятьКачество</name>
      <comment>При отклонении от нормы - отклонять качество</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЗначениеВнешнейПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИскатьВнешниеПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешняяПроба</name>
      <type>
        <types>DocumentRef.гкс_ВнешняяПроба</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольнаяСуммаВнешнейПробы</name>
      <comment>Контрольная сумма MD5</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиДляПерепроверки</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеИспользованияКачества</name>
      <type>
        <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ФормированиеНомераПробы/гкс_ФормированиеНомераПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ФормированиеНомераПробы</name>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>CatalogRef.гкс_НомерПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСуткиРегистрации</name>
    <comment>ERP-1431</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРегистраций</name>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СопоставлениеФНПЛабАнализа/ManagerModule.bsl
#Если ТолстыйКлиентОбычноеПриложение Или Сервер Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
//
// Модуль менеджера регистра сведений гкс_СопоставлениеФНПЛабАнализа
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Записывает сопоставление между ФормированиеНомераПробы и ЛабораторныйАнализ.
//
// Параметры:
//  ФормированиеНомераПробы - ДокументСсылка.гкс_ФормированиеНомераПробы - Документ ФНП.
//  ЛабораторныйАнализ - ДокументСсылка.гкс_ЛабораторныйАнализ - Документ лабораторного анализа
//
Процедура ЗаписатьСопоставление(ФормированиеНомераПробы, ЛабораторныйАнализ) Экспорт

	Если Не ЗначениеЗаполнено(ФормированиеНомераПробы) Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЛабораторныйАнализ) Тогда
		Возврат;
	КонецЕсли;

	// Получаем данные из документов
	ТипПробы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФормированиеНомераПробы, "ТипПробы");
	НазначениеИспользованияКачества = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛабораторныйАнализ, 
		"гкс_НазначениеИспользованияКачества");
	// Определяем усиленный контроль
	УсиленныйКонтроль = ОпределитьУсиленныйКонтроль(ЛабораторныйАнализ);

	Попытка
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ФормированиеНомераПробы = ФормированиеНомераПробы;
		МенеджерЗаписи.ЛабораторныйАнализ = ЛабораторныйАнализ;		
		МенеджерЗаписи.ТипПробы = ТипПробы;
		МенеджерЗаписи.НазначениеИспользования = НазначениеИспользованияКачества;
        МенеджерЗаписи.УсиленныйКонтроль = УсиленныйКонтроль;

		МенеджерЗаписи.Записать();

	Исключение 
		ИнформацияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			"СопоставлениеФНПЛабАнализа.ЗаписатьСопоставление",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.гкс_СопоставлениеФНПЛабАнализа,
			ФормированиеНомераПробы,
			СтрШаблон("Ошибка записи сопоставления ФНП: %1, ЛА: %2. %3",
				ФормированиеНомераПробы, ЛабораторныйАнализ,
				ИнформацияОбОшибке));
	КонецПопытки;

КонецПроцедуры


// Определяет признак усиленного контроля для лабораторного анализа.
//
// Параметры:
//  ЛабораторныйАнализ - ДокументСсылка.гкс_ЛабораторныйАнализ - Документ лабораторного анализа.
//  ИсточникСоздания - Строка - Идентификатор источника создания анализа.
//
// Возвращаемое значение:
//  Булево - Истина, если анализ относится к усиленному контролю.
//
Функция ОпределитьУсиленныйКонтроль(ЛабораторныйАнализ) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества") 
		Или Не ЗначениеЗаполнено(ЛабораторныйАнализ) Тогда
		Возврат Ложь;
	КонецЕсли;

	// Проверяем показатели анализа
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИСТИНА КАК УсиленныйКонтроль
		|ИЗ
		|	Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК КачественныеПоказатели
		|ГДЕ
		|	КачественныеПоказатели.Ссылка = &ЛабораторныйАнализ
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(*) > 0
		|	И КОЛИЧЕСТВО(*) = СУММА(ВЫБОР
		|		КОГДА КачественныеПоказатели.УсиленныйКонтроль = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ)";

	Запрос.УстановитьПараметр("ЛабораторныйАнализ", ЛабораторныйАнализ);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Первоначальное заполнение регистра сопоставлений из существующих данных.
// ЦЕПОЧКА ВЫЗОВОВ:
// 1. ОбработчикБСП.ПриДобавленииОбработчиковОбновления()
// Регистрирует обработчик с режимом "Монопольно"
// 2. -> РегистрыСведений.гкс_СопоставлениеФНПЛабАнализа.ПервоначальноеЗаполнениеСопоставлений()
// Эта процедура (выполняется в монопольном режиме)
// 3. -> Заполнение РС из существующих данных
// а.Документ.гкс_ЛабораторныйАнализ + Документ.гкс_ФормированиеНомераПробы
// (через Документ.гкс_РегистрацияНаПЛК)
// б.Документ.гкс_ЛабораторныйАнализ + Документ.гкс_ФормированиеНомераПробы
// (через реквизит гкс_ДокументРегистрации)
// АЛГОРИТМ:
// - Проверка что регистр пуст (предотвращение повторного заполнения)
// - Запрос существующих связей: ЛА -> Документ.гкс_РегистрацияНаПЛК -> ФНП
// - Запрос существующих связей: ЛА -> гкс_ДокументРегистрации -> ФНП
// - Транзакционное заполнение с обработкой ошибок
// - Логирование результатов в журнал регистрации
// 
// Параметры:
//  Параметры - Неопределено - Параметры
Процедура ПервоначальноеЗаполнениеСопоставлений(Параметры = Неопределено) Экспорт

	// Проверка что регистр пуст (предотвращение повторного заполнения)
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроверкиНаличияДанных();

	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;

	// Получаем существующие связи ЛА -> ФНП
	Запрос.Текст = ТекстЗапросаДанныхДляЗаполнения();

	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	Попытка

		Пока Выборка.Следующий() Цикл

			МенеджерЗаписи = СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.ФормированиеНомераПробы = Выборка.ФормированиеНомераПробы;
			МенеджерЗаписи.ЛабораторныйАнализ = Выборка.ЛабораторныйАнализ;		
			МенеджерЗаписи.ТипПробы = Выборка.ТипПробы;
			МенеджерЗаписи.НазначениеИспользования = Выборка.НазначениеИспользования;
	        МенеджерЗаписи.УсиленныйКонтроль = Выборка.УсиленныйКонтроль;
	
			МенеджерЗаписи.Записать();
		
		КонецЦикла;    

		ЗафиксироватьТранзакцию();
	Исключение

		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			"ОбновлениеИБ.ПервоначальноеЗаполнениеСопоставленияФНП.КритическаяОшибка",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.гкс_СопоставлениеФНПЛабАнализа,
			,
			СтрШаблон("Критическая ошибка первоначального заполнения. Транзакция отменена. %1",
				ИнформацияОбОшибке));
		ВызватьИсключение ИнформацияОбОшибке; 
	КонецПопытки;

	ЗаписьЖурналаРегистрации(
		"ОбновлениеИБ.ПервоначальноеЗаполнениеСопоставленияФНП",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.РегистрыСведений.гкс_СопоставлениеФНПЛабАнализа,
		,
		СтрШаблон("Первоначальное заполнение завершено"));
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает текст запроса для проверки наличия данных в регистре сопоставлений.
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция ТекстЗапросаПроверкиНаличияДанных()

	Возврат
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СопоставлениеФНПЛабАнализа.ФормированиеНомераПробы КАК ФормированиеНомераПробы
		|ИЗ
		|	РегистрСведений.гкс_СопоставлениеФНПЛабАнализа КАК СопоставлениеФНПЛабАнализа";

КонецФункции

// Возвращает текст запроса для получения данных первоначального заполнения регистра сопоставлений.
// Запрос объединяет данные из двух источников:
// 1. Единичные пробы: ЛА -> РегистрацияНаПЛК -> ФНП (через СписокРегистраций)
// 2. Композитные пробы: ЛА -> ФНП (через реквизит гкс_ДокументРегистрации)
//
// Возвращаемое значение:
//  Строка - Текст запроса с временными таблицами.
//
Функция ТекстЗапросаДанныхДляЗаполнения()

	Возврат
		"ВЫБРАТЬ
		|	ЛабораторныйАнализ.Ссылка КАК ЛабораторныйАнализ,
		|	ФормированиеНомераПробыСписокРегистраций.Ссылка КАК ФормированиеНомераПробы,
		|	ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества КАК НазначениеИспользования,
		|	ФормированиеНомераПробы.ТипПробы КАК ТипПробы,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛабораторныйАнализКачественныеПоказатели.Показатель) КАК ВсегоПоказателей,
		|	СУММА(ВЫБОР
		|		КОГДА ЛабораторныйАнализКачественныеПоказатели.УсиленныйКонтроль = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ПоказателейУК,
		|	РегистрацияНаПЛК.Ссылка КАК РегистрацииНаПЛК
		|ПОМЕСТИТЬ ВТ_ДанныеЕдиничные
		|ИЗ
		|	Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК ЛабораторныйАнализКачественныеПоказатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК
		|					ФормированиеНомераПробыСписокРегистраций
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
		|					ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = ФормированиеНомераПробы.Ссылка
		|				ПО ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
		|			ПО ЛабораторныйАнализ.гкс_ДокументРегистрации = РегистрацияНаПЛК.Ссылка
		|		ПО ЛабораторныйАнализКачественныеПоказатели.Ссылка = ЛабораторныйАнализ.Ссылка
		|ГДЕ
		|	ЛабораторныйАнализ.гкс_ДокументРегистрации ССЫЛКА Документ.гкс_РегистрацияНаПЛК
		|	И ЛабораторныйАнализ.Проведен
		|	И РегистрацияНаПЛК.Проведен
		|	И ФормированиеНомераПробы.Проведен
		|	И ФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
		|СГРУППИРОВАТЬ ПО
		|	ЛабораторныйАнализ.Ссылка,
		|	ФормированиеНомераПробыСписокРегистраций.Ссылка,
		|	ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества,
		|	ФормированиеНомераПробы.ТипПробы,
		|	РегистрацияНаПЛК.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛабораторныйАнализ.Ссылка КАК ЛабораторныйАнализ,
		|	ЛабораторныйАнализ.гкс_ДокументРегистрации КАК ФормированиеНомераПробы,
		|	ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества КАК НазначениеИспользования,
		|	ФормированиеНомераПробы.ТипПробы КАК ТипПробы,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(ЛабораторныйАнализКачественныеПоказатели.Показатель,
		|		ЗНАЧЕНИЕ(Справочник.гкс_ПоказателиАнализовНоменклатуры.ПустаяСсылка))) КАК ВсегоПоказателей,
		|	СУММА(ВЫБОР
		|		КОГДА ЛабораторныйАнализКачественныеПоказатели.УсиленныйКонтроль = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ПоказателейУК,
		|	РегистрацияНаПЛК.Ссылка КАК РегистрацииНаПЛК
		|ПОМЕСТИТЬ ВТ_ДанныеКомпозитные
		|ИЗ
		|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК
		|				гкс_ФормированиеНомераПробыСписокРегистраций
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|				ПО гкс_ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
		|			ПО ФормированиеНомераПробы.Ссылка = гкс_ФормированиеНомераПробыСписокРегистраций.Ссылка
		|		ПО ЛабораторныйАнализ.гкс_ДокументРегистрации = ФормированиеНомераПробы.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК
		|			ЛабораторныйАнализКачественныеПоказатели
		|		ПО ЛабораторныйАнализ.Ссылка = ЛабораторныйАнализКачественныеПоказатели.Ссылка
		|ГДЕ
		|	ЛабораторныйАнализ.гкс_ДокументРегистрации ССЫЛКА Документ.гкс_ФормированиеНомераПробы
		|	И ЛабораторныйАнализ.Проведен = ИСТИНА
		|	И ФормированиеНомераПробы.Проведен = ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|	ЛабораторныйАнализ.Ссылка,
		|	ЛабораторныйАнализ.гкс_ДокументРегистрации,
		|	ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества,
		|	ФормированиеНомераПробы.ТипПробы,
		|	РегистрацияНаПЛК.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеКомпозитные.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
		|	ВТ_ДанныеКомпозитные.ФормированиеНомераПробы КАК ФормированиеНомераПробы,
		|	ВТ_ДанныеКомпозитные.НазначениеИспользования КАК НазначениеИспользования,
		|	ВТ_ДанныеКомпозитные.ТипПробы КАК ТипПробы,
		|	ВТ_ДанныеКомпозитные.ВсегоПоказателей КАК ВсегоПоказателей,
		|	ВТ_ДанныеКомпозитные.ПоказателейУК КАК ПоказателейУК,
		|	ВТ_ДанныеКомпозитные.РегистрацииНаПЛК КАК РегистрацииНаПЛК
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	ВТ_ДанныеКомпозитные КАК ВТ_ДанныеКомпозитные
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеЕдиничные.ЛабораторныйАнализ,
		|	ВТ_ДанныеЕдиничные.ФормированиеНомераПробы,
		|	ВТ_ДанныеЕдиничные.НазначениеИспользования,
		|	ВТ_ДанныеЕдиничные.ТипПробы,
		|	ВТ_ДанныеЕдиничные.ВсегоПоказателей,
		|	ВТ_ДанныеЕдиничные.ПоказателейУК,
		|	ВТ_ДанныеЕдиничные.РегистрацииНаПЛК
		|ИЗ
		|	ВТ_ДанныеЕдиничные КАК ВТ_ДанныеЕдиничные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
		|	ВТ_Данные.ФормированиеНомераПробы КАК ФормированиеНомераПробы,
		|	ВТ_Данные.НазначениеИспользования КАК НазначениеИспользования,
		|	ВТ_Данные.ТипПробы КАК ТипПробы,
		|	ВЫБОР
		|		КОГДА ВТ_Данные.ВсегоПоказателей > 0
		|		И ВТ_Данные.ВсегоПоказателей = ВТ_Данные.ПоказателейУК
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК УсиленныйКонтроль
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Данные.ЛабораторныйАнализ,
		|	ВТ_Данные.ФормированиеНомераПробы,
		|	ВТ_Данные.НазначениеИспользования,
		|	ВТ_Данные.ТипПробы,
		|	ВЫБОР
		|		КОГДА ВТ_Данные.ВсегоПоказателей > 0
		|		И ВТ_Данные.ВсегоПоказателей = ВТ_Данные.ПоказателейУК
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";

КонецФункции

#КонецОбласти
#КонецЕсли
